kylemanna/kinetis-sdk2/boards/twrk21f120m/demo_apps/emvl1_freertos/emvl1_freertos.c
/*******************************************************************************
* Code
******************************************************************************/

/* IRQ handler for uart */
void UART0_RX_TX_IRQHandler(void)
{
    SMARTCARD_UART_IRQHandler(BOARD_SMARTCARD_MODULE, g_smartcardContext);
}
/* Error IRQ handler for uart */
void UART0_ERR_IRQHandler(void)
{
    SMARTCARD_UART_ErrIRQHandler(BOARD_SMARTCARD_MODULE, g_smartcardContext);
}
/* Pit timer channel 0 IRQ handler */
void PIT0_IRQHandler(void)
{
    SMARTCARD_UART_TSExpiryCallback(BOARD_SMARTCARD_MODULE, g_smartcardContext);
}
/* IRQ handler for card presence detection */
void PORTD_IRQHandler(void)
{
    /* Clear interrupt status flags */
    PORT_ClearPinsInterruptFlags(PORTD, 1u << 14u);
    SMARTCARD_PHY_TDA8035_IRQHandler(BOARD_SMARTCARD_MODULE, g_smartcardContext);
}
/* Time delay required by smartcard test and smartcard driver */
void timeDelay(uint32_t microseconds)
{
    PIT_ClearStatusFlags(PIT, kPIT_Chnl_1, PIT_TFLG_TIF_MASK);
    while(microseconds > 0)
    {
        if (PIT_GetStatusFlags(PIT, kPIT_Chnl_1) == 1)
        {
            PIT_ClearStatusFlags(PIT, kPIT_Chnl_1, PIT_TFLG_TIF_MASK);
            microseconds--;
        }
    }
}

/* Function initializes time delay for smartcard driver */
void initTimeDelay()
{
    pit_config_t pitConfig;
    PIT_GetDefaultConfig(&pitConfig);
    PIT_Init(PIT, &pitConfig);
    PIT_SetTimerPeriod(PIT, kPIT_Chnl_1, (USEC_TO_COUNT(1U, BUS_CLK_FREQ)-1));
    PIT_StartTimer(PIT, kPIT_Chnl_1);
}

void smartcard_interrupts_config(void)
{
    /* Set smartcard communication peripheral interrupt priority */
    NVIC_SetPriority(BOARD_SMARTCARD_MODULE_IRQ, 8u);
#if defined(BOARD_SMARTCARD_MODULE_ERRIRQ)
    NVIC_SetPriority(BOARD_SMARTCARD_MODULE_ERRIRQ, 8u);
#endif
/* Set smartcard presence detect gpio pin interrupt priority */
#if defined(USING_PHY_TDA8035)
    NVIC_SetPriority(BOARD_SMARTCARD_IRQ_PIN_IRQ, 6u);
#endif /* USING_TDA8035_INTERFACE */
       /* Set external PIT timer interrupt priority
        * (used for initial TS char detection time-out) */
#if !(defined(FSL_FEATURE_SOC_EMVSIM_COUNT) && (FSL_FEATURE_SOC_EMVSIM_COUNT))
#if !defined(BOARD_SMARTCARD_TS_TIMER_IRQ)
#error "Please specify external PIT timer interrupt !"
#else
    NVIC_SetPriority(BOARD_SMARTCARD_TS_TIMER_IRQ, 6u);
#endif
#endif
}

/*!
 * @brief This function initialize smartcard_user_config_t structure. Enables configuration
 * of most common settings of the UART peripheral, smartcard clock, smartcard interface configuration,
 * interface instance number, slot number, operating voltage ...
 */
static void smartcard_init_user_config(rtos_smartcard_context_t *context)
{
    /* Initialize interface configuration structure to default values */
    context->x_context.interfaceConfig.smartCardClock = BOARD_SMARTCARD_CLOCK_VALUE;
    context->x_context.interfaceConfig.vcc = kSMARTCARD_VoltageClassB3_3V;
    context->x_context.interfaceConfig.clockModule = BOARD_SMARTCARD_CLOCK_MODULE;
    context->x_context.interfaceConfig.clockModuleChannel = BOARD_SMARTCARD_CLOCK_MODULE_CHANNEL;
    context->x_context.interfaceConfig.clockModuleSourceClock = BOARD_SMARTCARD_CLOCK_MODULE_SOURCE_CLK;
    context->x_context.interfaceConfig.controlPort = BOARD_SMARTCARD_CONTROL_PORT;
    context->x_context.interfaceConfig.controlPin = BOARD_SMARTCARD_CONTROL_PIN;
#if defined(BOARD_SMARTCARD_IRQ_PORT)
    context->x_context.interfaceConfig.irqPort = BOARD_SMARTCARD_IRQ_PORT;
    context->x_context.interfaceConfig.irqPin = BOARD_SMARTCARD_IRQ_PIN;
#endif
    context->x_context.interfaceConfig.resetPort = BOARD_SMARTCARD_RST_PORT;
    context->x_context.interfaceConfig.resetPin = BOARD_SMARTCARD_RST_PIN;
#if defined(USING_PHY_TDA8035)
    context->x_context.interfaceConfig.vsel0Port = BOARD_SMARTCARD_VSEL0_PORT;
    context->x_context.interfaceConfig.vsel0Pin = BOARD_SMARTCARD_VSEL0_PIN;
    context->x_context.interfaceConfig.vsel1Port = BOARD_SMARTCARD_VSEL1_PORT;
    context->x_context.interfaceConfig.vsel1Pin = BOARD_SMARTCARD_VSEL1_PIN;
#endif
#if defined(BOARD_SMARTCARD_TS_TIMER_ID)
    context->x_context.interfaceConfig.tsTimerId = BOARD_SMARTCARD_TS_TIMER_ID;
#endif
}

/*!
 * @brief Callback function for the Smartcard interface/PHY IC ISR
 */
void smartcard_interface_callback_function(void *context, void *param)
{
    /* Post sync object */
    BaseType_t xHigherPriorityTaskWoken, xResult;

    xHigherPriorityTaskWoken = pdFALSE;
    xResult = pdFAIL;

    xResult = xEventGroupSetBitsFromISR(phy_event, SMARTCARD_SOCKET_EVENT, &xHigherPriorityTaskWoken);

    if (xResult != pdFAIL)
    {
        portYIELD_FROM_ISR(xHigherPriorityTaskWoken);
    }
}

/*! @brief This function waits for card insertion/detection */
void smartcard_wait_for_card_presence(smartcard_core_params_t *coreParams)
{
    smartcard_interface_control_t interfaceControl = kSMARTCARD_InterfaceReadStatus;
    smartcard_context_t *context = &((rtos_smartcard_context_t *)coreParams->x_context)->x_context;
    EventBits_t ev;

    /* Clear synchronization event bits */
    ev = xEventGroupClearBits(phy_event, SMARTCARD_SOCKET_EVENT);
    assert(ev == 0);
    /* Putting delay as few boards has de-bouncing cap in card slot presence detect pin */
    timeDelay(1000 * 1000);
    /* clear present flag */
    ((smartcard_context_t *)coreParams->x_context)->cardParams.present = 0;
    /* Read card presence status */
    SMARTCARD_RTOS_PHY_Control(coreParams->x_context, interfaceControl, 0);
    /* Check if a card is already inserted */
    if (!context->cardParams.present)
    {
        PRINTF("Please insert a smart card to test\r\n");
    }

    while (true)
    {
        /* Read card presence status */
        SMARTCARD_RTOS_PHY_Control(coreParams->x_context, interfaceControl, 0);
        /* Return if card is present/inserted */
        if (context->cardParams.present)
        {
            break;
        }
        /* Wait until a interface/PHY interrupt event occurs */
        ev = xEventGroupWaitBits(phy_event, SMARTCARD_SOCKET_EVENT, pdTRUE, pdFALSE, 0xFFFFFFFF);
        if (ev & SMARTCARD_SOCKET_EVENT)
        {
            break;
        }
    }
}
/*!
 * @brief Function searches for appropriate card AID from hard-coded table.
 */
card_type_t scan_aid(smartcard_core_params_t *coreParams, smartcard_tal_cmd_t *cmd, smartcard_tal_resp_t *resp)
{
    smartcard_core_error_t status;
    uint32_t i;

    for (i = 0; i < AID_ENTRIES; i++)
    {
        txBuff[0] = 0x00u;
        txBuff[1] = 0xA4u;
        txBuff[2] = 0x04u;
        txBuff[3] = 0x00u;
        txBuff[4] = g_aidTable[i][1];

        memcpy(&txBuff[5u], (uint8_t *)g_aidTable[i][0u], g_aidTable[i][1u]);
        txBuff[5u + g_aidTable[i][1u]] = 0x00u;
        cmd->length = 5u + g_aidTable[i][1u] + 1u;

        status = smartcard_tal_send_cmd(coreParams, cmd, resp);

        smartcard_context_t *drvCtx = &((rtos_smartcard_context_t *)coreParams->x_context)->x_context;

        uint8_t sw1 = drvCtx->statusBytes[0u];
        uint8_t sw2 = drvCtx->statusBytes[1u];
        /* Check status bytes, 0x6A 0x82 - File not found */
        if ((status == kSCCoreSuccess) && !(sw1 == 0x6A && sw2 == 0x82))
        { /* Match found. */
            switch (i)
            {
                case 0u:
                    return kCardMastercard;
                case 1u:
                    return kCardVisa;
                case 2u:
                    return kCardVisaElectron;
                case 3u:
                    return kCardAmex;
                case 4u:
                    return kCardEuropay;
                case 5u:
                    return kCardUnionPayDebit;
                case 6u:
                    return kCardUnionPayCredit;
            }
        }
    }
    /* No match. */
    return kCardUnsupported;
}
/*!
 * @brief Function sends EMV commands (Get processing options or read of specific record) to ICC.
 */
smartcard_core_error_t send_command(smartcard_core_params_t *coreParams,
                                    uint8_t p1,
                                    uint8_t p2,
                                    smartcard_tal_cmd_t *cmd,
                                    smartcard_tal_resp_t *resp,
                                    card_type_t type)
{
    /* Sending Get processing information */
    if ((0u == p1) && (0u == p2))
    {
        if (type == kCardUnsupported)
        {
            return kSCCoreInvalidInputParameter;
        }
        /* Union Pay cards require to send PDOL from terminal as command data (additional informative tag),
         * according AID file selection response. */
        if ((type == kCardUnionPayDebit) || (type == kCardUnionPayCredit))
        {
            cmd->apdu[0u] = 0x80u; /* Command class */
            cmd->apdu[1u] = 0xA8u; /* INS byte */
            cmd->apdu[2u] = 0x00u; /* P1 */
            cmd->apdu[3u] = 0x00u; /* P2 */
            cmd->apdu[4u] = 0x0Bu; /* Lc = 0x0B */
            /* Lc data */
            cmd->apdu[5u] =
                0x83u; /* Tag indicating requested PDOL objects parsed from AID selection file command response. */
            cmd->apdu[6u] = 0x09u; /* Length of PDOL data. (Data is send without tags.) */
            /* Hard-coded PDOL objects without objects tags. */
            /* VLP Terminal Support Indicator */
            cmd->apdu[7u] = 0x00u;
            /* Amount, Authorised (Numeric) */
            cmd->apdu[8u] = 0x00u;
            cmd->apdu[9u] = 0x00u;
            cmd->apdu[10u] = 0x00u;
            cmd->apdu[11u] = 0x00u;
            cmd->apdu[12u] = 0x01u;
            cmd->apdu[13u] = 0x00u;
            /* Transaction Currency code */
            cmd->apdu[14u] = 0x01u; /* China CNY */
            cmd->apdu[15u] = 0x56u; /* China CNY */
            cmd->apdu[16u] = 0u;    /* Le = 0 */
            cmd->length = 17u;
        }
        else
        { /* Most of MASTER and VISA cards doesn't require sending terminal PDOL tags.
           * Get processing options is send without PDOL tags.*/
            cmd->apdu[0u] = 0x80u;
            cmd->apdu[1u] = 0xA8u;
            cmd->apdu[2u] = 0x00u;
            cmd->apdu[3u] = 0x00u;
            cmd->apdu[4u] = 0x02u;
            cmd->apdu[5u] = 0x83u;
            cmd->apdu[6u] = 0x00u;
            cmd->apdu[7u] = 0x00u;
            cmd->length = 8u;
        }
    }
    else
    {                               /* Read record command to get specific data. */
        cmd->apdu[0u] = 0x00u;      /* Command class */
        cmd->apdu[1u] = 0xB2u;      /* INS - read record */
        cmd->apdu[2u] = p1;         /* P1 */
        cmd->apdu[3u] = p2 | 0x04u; /* P2 */
        cmd->apdu[4u] = 0x00u;      /* Lc = 0 */
        cmd->length = 5u;
    }
    return smartcard_tal_send_cmd(coreParams, cmd, resp);
}

/*!
 * @briefExtract AFL list from GET_PROCESSING_OPTIONS response.
 */
int extract_afl_list(uint8_t list[MAX_AFL][4], uint8_t *src)
{
    uint32_t i;
    uint32_t size = 0u;

