kylemanna/kinetis-sdk2/boards/twrk21f120m/demo_apps/emvl1_freertos/emvl1_freertos.c
    /* Format is tag '80' */
    if (src[0u] == 0x80u)
    {
        /* Subtract 2 from the size (the two bytes being ignored are the AIP. */
        size = src[1u] - 2u;
        if ((size / 4u) > MAX_AFL)
        {
            return 0u;
        }
        for (i = 0u; i < (size / 4u); i++)
        {
            list[i][0u] = src[4u + (i * 4u)];
            list[i][1u] = src[5u + (i * 4u)];
            list[i][2u] = src[6u + (i * 4u)];
            list[i][3u] = src[7u + (i * 4u)];
        }
    }
    /* Format is tag '77' */
    else if (src[0u] == 0x77u)
    {
        /* The size is embedded a bit deeper into the frame. */
        size = src[7u];
        if ((size / 4u) > MAX_AFL)
        {
            return 0u;
        }
        for (i = 0u; i < (size / 4u); i++)
        {
            list[i][0u] = src[8u + (i * 4u)];
            list[i][1u] = src[9u + (i * 4u)];
            list[i][2u] = src[10u + (i * 4u)];
            list[i][3u] = src[11u + (i * 4u)];
        }
    }
    return size / 4u;
}

/*!
 * @brief Parse a READ_RECORD response and extract card info.
 */
int extract_card_info(uint8_t *src)
{
    uint32_t i, itemStart, itemSize, itemNum;

    for (itemNum = 0u; itemNum < DESIRED_CARD_INFO_TAGS; itemNum++)
    {
        if (cardItem_found[itemNum])
        {
            continue;
        }
        /* Find the starting point of the searched item. */
        i = 0;
        itemSize = 0u;
        while (!((src[i] == 0x90u) && (src[i + 1u] == 0x00u)))
        {
            if ((src[i] == g_desiredTags[itemNum][0u]) &&
                ((g_desiredTags[itemNum][1u] == 0u) || (src[i + 1u] == g_desiredTags[itemNum][1u])))
            {
                if ((g_desiredTags[itemNum][0u] == 0x5A) && (src[i + 1u] > 10u))
                {
                    i++;
                    continue;
                }
                if (0u == g_desiredTags[itemNum][1u])
                {
                    itemStart = i + 2u;
                    itemSize = src[i + 1u];
                }
                else
                {
                    itemStart = i + 3u;
                    itemSize = src[i + 2u];
                }
                break;
            }
            i++;
        }
        /* Extract the data element body field.*/
        if (itemSize)
        {
            i = 0u;
            while (i < itemSize)
            {
                card_items[itemNum][i] = src[itemStart + i];
                if (itemNum == 0x02u && (src[itemStart + i] == 0x20u) && (src[itemStart + i + 1u] == 0x20u))
                { /* Terminate the string.*/
                    card_items[itemNum][i] = 0x00u;
                    break;
                }
                i++;
            }
            /* If we reached the end without having two spaces, terminate the string. */
            if (itemNum == 0x02u && i == itemSize)
            {
                card_items[itemNum][i] = 0x00u;
            }
            cardItem_found[itemNum] = true;
        }
    }
    for (itemNum = 0u; itemNum < DESIRED_CARD_INFO_TAGS; itemNum++)
    {
        if (!cardItem_found[itemNum])
        {
            return -1;
        }
    }
    return 0;
}

/*!
 * @ Function checks status bytes of last smartcard transfer.
 */
static int8_t smartcard_tc_check_testresult(smartcard_core_params_t *coreParams)
{
    if (coreParams->errCode == kSCCoreSuccess)
    {
        PRINTF("TEST PASSED.\r\n");
    }
    else
    {
        PRINTF("TEST FAILED.\r\n");
    }

    PRINTF("Returned Status Bytes = 0x%2X, 0x%2X\r\n",
           ((rtos_smartcard_context_t *)coreParams->x_context)->x_context.statusBytes[0],
           ((rtos_smartcard_context_t *)coreParams->x_context)->x_context.statusBytes[1]);

    return (coreParams->errCode);
}

/*!
 * @brief T=0 protocol test using EMV Level 1 APIs
 */
static bool smartcard_emvl1_t0_test(smartcard_core_params_t *coreParams)
{
    uint32_t i, j;
    smartcard_tal_cmd_t talCmd = {0};
    smartcard_tal_resp_t talResp = {0};
    card_type_t type;
    uint8_t aflList[MAX_AFL][4u];
    uint32_t aflListSize = 0u;
    uint8_t number = 0u;
    bool found = false;

    talResp.resp = rxBuff;
    talCmd.apdu = txBuff;
    PRINTF("==========================================\r\n");
    PRINTF("Protocol T=0 test started!\r\n");

    memset(rxBuff, 0, EMVL1_MAX_TRANSFER_SIZE);
    /* T=0 transport test */
    smartcard_setup_t0(coreParams);
    /* Search smartcard AID */
    type = scan_aid(coreParams, &talCmd, &talResp);
    if (kCardUnsupported == type)
    {
        return false;
    }
    memset(rxBuff, 0u, EMVL1_MAX_TRANSFER_SIZE);
    /* Obtain processing options to read card additional information from records */
    if (kSCCoreSuccess != send_command(coreParams, 0u, 0u, &talCmd, &talResp, type))
    {
        PRINTF("Obtaining processing options failed.\r\n");
        return false;
    }
    aflListSize = extract_afl_list(aflList, talResp.resp);
    if (0u == aflListSize)
    {
        PRINTF("Parsing received AFL list failed. \r\n");
        return false;
    }
    /* Read card records to get wanted card info */
    PRINTF("Reading card records to get required data. \r\n");
    /* 'i' is for the list of AFLs present. */
    for (i = 0u; i < aflListSize; i++)
    { /* 'j' is for the number of records in each AFL. */
        for (j = aflList[i][1u]; j <= aflList[i][2u]; j++)
        { /* Send READ_RECORD. */
            if (kSCCoreSuccess != send_command(coreParams, j, aflList[i][0u], &talCmd, &talResp, kCardUnsupported))
            { /* Give up and start a new iteration of the loop. */
                continue;
            }
            /* Parse read record for required data */
            if (0u == extract_card_info(talResp.resp))
            {
                found = true;
                break;
            }
        }
        /* Break when found. */
        if (found)
        {
            break;
        }
    }
    PRINTF("- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - \r\n");
    PRINTF("Card info:\r\n");
    /* Check if PAN was found */
    if (cardItem_found[0])
    {
        PRINTF("          Primary account number: ");
        for (i = 0u; i < PRIMARY_ACCOUNT_NUMBER_LEN; i++)
        {
            if ((0x00u == card_items[0u][i]) && (0x00u == card_items[0u][i + 1u]))
            {
                break;
            }
            number = (uint8_t)(card_items[0u][i] >> 4u) + 0x30u;
            if (number > 0x39u)
            {
                break;
            }
            PRINTF("%c", number);
            number = (uint8_t)(card_items[0u][i] & 0xFu) + 0x30u;
            if (number > 0x39u)
            {
                break;
            }
            PRINTF("%c ", number);
        }
        PRINTF("\r\n");
    }
    /* Check if Application expiration date was found */
    if (cardItem_found[1u])
    {
        PRINTF("          Application expiration date: ");
        for (i = APP_EXP_DATE_LEN; i > 0u; i--)
        {
            if (0u == card_items[1][i - 1])
            {
                continue;
            }
            PRINTF("%c%c", (uint8_t)(card_items[1][i - 1] >> 4u) + 0x30u,
                   (uint8_t)(card_items[1u][i - 1] & 0x0Fu) + 0x30u);
            if (0u != (i - 1u))
            {
                PRINTF("/");
            }
        }
        PRINTF("\r\n");
    }
    /* Check if Cardholder name was found */
    if (cardItem_found[2u])
    {
        /* Check if cardholder name is valid */
        bool valid = false;
        for (i = 0; i < CARDHOLDER_NAME_LEN; i++)
        {
            if ((0x00u != card_items[2u][i]) || (0x20 != card_items[2u][i]))
            {
                valid = true;
            }
        }
        if (valid)
        {
            PRINTF("          Cardholder name: ");
            for (i = 0; i < CARDHOLDER_NAME_LEN; i++)
            {
                if (((0x20u == card_items[2u][i]) && (0x20u == card_items[2u][i + 1u])) || (0x00u == card_items[2u][i]))
                {
                    break;
                }
                PRINTF("%c", card_items[2u][i]);
            }
            PRINTF("\r\n- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - \r\n");
        }
    }

