kylemanna/kinetis-sdk2/boards/twrk21f120m/demo_apps/emvl1_freertos/emvl1_freertos.c
    return true;
}

/*!
 * @brief T=1 protocol test using EMV Level 1 APIs.
 */
static bool smartcard_emvl1_t1_test(smartcard_core_params_t *coreParams)
{
    int length;
    int i;
    int increment = 1;
    smartcard_tal_cmd_t talCmd;
    smartcard_tal_resp_t talResp;

    PRINTF("==========================================\r\n");
    PRINTF("Protocol T=1 test started!\r\n");

    /******************* Setup for T=0 transfer *******************/
    smartcard_setup_t0(coreParams);
    /* send a PPS indicating T=1 protocol */
    txBuff[0u] = 0xFFu;
    txBuff[1u] = 0x01u;
    txBuff[2u] = 0x00u;

    for (i = 0u; i < 2u; i++)
    {
        txBuff[2u] ^= txBuff[i];
    }

    memset(rxBuff, 0, EMVL1_MAX_TRANSFER_SIZE);
    smartcard_send_pps(coreParams, txBuff, rxBuff, 3);

    /* T=1 protocol test */
    length = 16u; /* payload */
    /* APDU */
    txBuff[0u] = 0xC0u;
    txBuff[1u] = 0x14u;     /* instruction code (0x14 for ECHO) */
    txBuff[2u] = increment; /* increment value - P1 */
    txBuff[3u] = 0u;        /* P2 */
    txBuff[4u] = length;    /* P3 = Lc */

    for (i = 0u; i < length; i++)
    {
        txBuff[i + 5u] = i;
    }

    /* last byte is the data length again */
    txBuff[length + 5u] = length;
    /******************* Setup for T=1 transfer *******************/
    smartcard_setup_t1(coreParams);

    talResp.resp = rxBuff;
    talCmd.apdu = txBuff;
    talCmd.length = (4u + 1u + txBuff[4u] + 1u);
    talResp.length = 0u;
    smartcard_tal_send_cmd(coreParams, &talCmd, &talResp);

    /* payload length */
    if (talResp.length != (length + 2))
    {
        return false;
    }

    for (i = 0u; i < length; i++)
    {
        if ((txBuff[i + 5u] + increment) != rxBuff[i])
        {
            PRINTF("Echo test Failed.\r\n");
            return false;
        }
    }
    PRINTF("Echo data matched!\r\n");

    return (kSCCoreSuccess == smartcard_tc_check_testresult(coreParams));
}

/*!
 * @brief This test will use EMV Level 1 APIs from emvlib and do protocol tests for T=0 using a
 * smartcard credit cards.
 */
void smartcard_emvl1_test(void *param)
{
    uint8_t *atrBuff = (uint8_t *)pvPortMalloc(EMVL1_ATR_BUFF_SIZE);
    uint32_t atrLength = 0u;
    bool testT0done = false;
    bool testT1done = false;

    bool testPassed = false;
    smartcard_core_params_t *coreParams = (smartcard_core_params_t *)pvPortMalloc(sizeof(smartcard_core_params_t));
    rtos_smartcard_context_t *rtosSmartcardContext =
        (rtos_smartcard_context_t *)pvPortMalloc(sizeof(rtos_smartcard_context_t));

    if (NULL != rtosSmartcardContext)
    {
        g_smartcardContext = &rtosSmartcardContext->x_context;
    }
    timeDelay(1000 * 1000u);
    /* Create SMARTCARD phy synchronization object */
    phy_event = xEventGroupCreate();
    if ((NULL == atrBuff) || (NULL == phy_event) || (NULL == coreParams) || (NULL == rtosSmartcardContext))
    {
        PRINTF("Resources allocation failure. Demo ends ... \r\n");
        /* Free all allocated resources */
        if (NULL != atrBuff)
        {
            vPortFree(atrBuff);
        }
        if (NULL != phy_event)
        {
            vEventGroupDelete(phy_event);
        }
        if (NULL != coreParams)
        {
            vPortFree(coreParams);
        }
        if (NULL != rtosSmartcardContext)
        {
            vPortFree(rtosSmartcardContext);
        }
        vTaskSuspend(NULL);
        while (1)
        {
        }
    }
    memset(coreParams, 0, sizeof(smartcard_core_params_t));
    memset(g_smartcardContext, 0, sizeof(smartcard_context_t));
    /* initialize EMV Level 1 core library */

    /* app must set EMVL1 in structure smartcard_core_params_t to 1 for emvl1, or 0 for 7816 */
    coreParams->EMVL1 = 1;

    coreParams->x_context = rtosSmartcardContext;
    /* Initialize smartcard interrupts */
    smartcard_interrupts_config();
    /* Install time delay defined in application to smartcard driver. */
    g_smartcardContext->timeDelay = timeDelay;
    /* Fill-in smartcard config structure with init data */
    smartcard_init_user_config(rtosSmartcardContext);
    /* Print welcome string */
    PRINTF("........................... EMVL1 FreeRTOS demo ..............................\r\n");
    /* Initialize the smartcard module with base address and configuration structure*/
    SMARTCARD_RTOS_Init(base, rtosSmartcardContext, BOARD_SMARTCARD_CLOCK_MODULE_CLK_FREQ);
    /* Install test/application callback function */
    rtosSmartcardContext->x_context.interfaceCallback = smartcard_interface_callback_function;
    /* Wait for a card inserted */
    smartcard_wait_for_card_presence(coreParams);
    PRINTF("Card inserted.\r\n");
    /* Deactivate the card */
    PRINTF("Deactivating card...");
    SMARTCARD_RTOS_PHY_Deactivate(rtosSmartcardContext);
    PRINTF("Done!\r\n");

    do
    {
        /* Invalidate ATR buffer first */
        memset(atrBuff, 0, EMVL1_ATR_BUFF_SIZE);
        /* Deactivate the card */
        PRINTF("Resetting/Activating card...");
        /* get ATR */
        atrLength = 0;
        if (smartcard_reset_handle_atr(coreParams, atrBuff, kSMARTCARD_ColdReset, kSMARTCARD_NoWarmReset, &atrLength) ==
            kSCCoreFail)
        {
            PRINTF("Invalid ATR received!\r\n");
            break;
        }
        PRINTF("Done!\r\n");

        if (rtosSmartcardContext->x_context.cardParams.t0Indicated && (!testT0done))
        {
            /* Invoke T=0 protocol specific test */
            testPassed = smartcard_emvl1_t0_test(coreParams);
            testT0done = true;
            if (!testPassed)
            {
                PRINTF("Unsupported card inserted.\r\n");
                PRINTF("Received status bytes: 0x%.2X, 0x%.2X \r\n", rtosSmartcardContext->x_context.statusBytes[0u],
                       rtosSmartcardContext->x_context.statusBytes[1u]);
            }
        }
        else if (rtosSmartcardContext->x_context.cardParams.t1Indicated && (!testT1done))
        {
            /* Invoke T=1 protocol specific test */
            testPassed = smartcard_emvl1_t1_test(coreParams);
            testT1done = true;
            if (!testPassed)
            {
                PRINTF("Unsupported card inserted.\r\n");
            }
        }
        /* Deactivate the card */
        PRINTF("Deactivating card...");
        SMARTCARD_RTOS_PHY_Deactivate(coreParams->x_context);
        PRINTF("Done!\r\n\r\n");
        if (testT1done || !rtosSmartcardContext->x_context.cardParams.t1Indicated)
        {
            break;
        }
    } while (1);

    /* De-initialize smartcard driver */
    SMARTCARD_RTOS_Deinit(coreParams->x_context);
    PRINTF("***** EMVL1 FreeRTOS Demo End *****\r\n\r\n");
    /* Release allocated resources */
    vPortFree(atrBuff);
    vEventGroupDelete(phy_event);
    vPortFree(coreParams);
    vPortFree(rtosSmartcardContext);
    vTaskSuspend(NULL);
}

/*!
 * @brief Main function.
 */
int main(void)
{
    /* Initialize board hardware */
    BOARD_InitPins();

    /* Initialize pin interrupt */
    PORT_SetPinInterruptConfig(PORTD, 14u, kPORT_InterruptEitherEdge);

    BOARD_BootClockRUN();
    BOARD_InitDebugConsole();

    /* Initializes time delay for smartcard driver */
    initTimeDelay();

    /* Create emvl1 demonstration task */
    xTaskCreate(smartcard_emvl1_test, /* Function which implements the task */
                "emvl1_test",         /* Task name */
                TASK_STACK_SIZE,      /* Stack size in [words] */
                NULL,                 /* Task input parameter */
                EMVL1_TASK_PRIORITY,  /* Task priority */
                NULL);                /* Task context */

    /* Start the tasks and timer running. */
    vTaskStartScheduler();
    /* Scheduler should never reach this point. */
    for (;;)
    {
    }
}
